### Criando Dataframes

Links úteis:

- [Getting started](https://pandas.pydata.org/docs/getting_started/index.html)

- [Documentação](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html)

Definição de dataframes: é um objeto bi-dimensional que contém dados em formato tabular. Ou seja, é como se fosse uma tabela do excel sendo possível adicionar linhas e colunas.

In [2]:
# importando a biblioteca pandas para trabalhar com dataframes
import pandas as pd

In [3]:
# criando o dataframe
df1 = pd.DataFrame()

In [4]:
type(df1)

pandas.core.frame.DataFrame

In [5]:
# criando dataframe através de um dicionário

dict1 = {'identificação': [1, 2, 3, 4, 5], 
         'nomes': ['Caio', 'Rodrigo', 'Rafael', 'Mariana', 'Matheus']}

dict1

{'identificação': [1, 2, 3, 4, 5],
 'nomes': ['Caio', 'Rodrigo', 'Rafael', 'Mariana', 'Matheus']}

In [6]:
df2 = pd.DataFrame(data = dict1)

In [7]:
df2

   identificação    nomes
0              1     Caio
1              2  Rodrigo
2              3   Rafael
3              4  Mariana
4              5  Matheus

In [8]:
# definindo o índice das linhas usando o parâmetro index
df3 = pd.DataFrame(data = dict1, index= [29, 1, 0, 2222, 88])
df3

      identificação    nomes
29                1     Caio
1                 2  Rodrigo
0                 3   Rafael
2222              4  Mariana
88                5  Matheus

In [9]:
# podemos usar o método Series() para criar uma coluna no dataframe
serie1 = pd.Series([1, 2, 3])
serie1

0    1
1    2
2    3
dtype: int64

In [10]:
serie2 = pd.Series(['a', 'b', 'c'])

In [11]:
df4 = pd.DataFrame({'coluna1': serie1,
                   'coluna2': serie2})

df4

   coluna1 coluna2
0        1       a
1        2       b
2        3       c

In [12]:
# importando a biblioteca numpy
import numpy as np

In [13]:
# criando um array usando a biblioteca numpy e método array
array1 = np.array([[1, 2, 3],
                   ['São Paulo', 'Rio de Janeiro', 'Campinas'],
                    ['SP', 'RJ', 'SP']])

In [14]:
type(array1)

numpy.ndarray

In [15]:
# criando um dataframe utilizando um array
df5 = pd.DataFrame(data = array1,
                   index=['linha1', 'linha2', 'linha3'],
                   columns= ['identificação', 'cidade', 'estado'])

In [16]:
df5

       identificação          cidade    estado
linha1             1               2         3
linha2     São Paulo  Rio de Janeiro  Campinas
linha3            SP              RJ        SP

In [17]:
# corrigindo o dataframe usando a transposição de linhas e colunas
df5 = pd.DataFrame(data = array1.transpose(),
                   index=['linha1', 'linha2', 'linha3'],
                   columns= ['identificação', 'cidade', 'estado'])

In [18]:
df5

       identificação          cidade estado
linha1             1       São Paulo     SP
linha2             2  Rio de Janeiro     RJ
linha3             3        Campinas     SP

In [19]:
# criando uma matrix usando o método matrix

matriz1 = np.matrix([[1, 2, 3],
                    ['São Paulo', 'Rio de Janeiro', 'Campinas'],
                    ['SP', 'RJ', 'SP']])

In [20]:
# criando um dataframe usando a matrix criada anteriormente

df6 = pd.DataFrame(data= matriz1.transpose(),
                   index= ['linha1', 'linha2', 'linha3'],
                   columns= ['identificação', 'cidade', 'estado'])

In [21]:
df6

       identificação          cidade estado
linha1             1       São Paulo     SP
linha2             2  Rio de Janeiro     RJ
linha3             3        Campinas     SP

### Selecionando Dataframes

In [22]:
df3

      identificação    nomes
29                1     Caio
1                 2  Rodrigo
0                 3   Rafael
2222              4  Mariana
88                5  Matheus

In [23]:
# adicionando uma nova coluna ao dataframe
df3['identificação_mais_5'] = df3['identificação'] + 5

df3

      identificação    nomes  identificação_mais_5
29                1     Caio                     6
1                 2  Rodrigo                     7
0                 3   Rafael                     8
2222              4  Mariana                     9
88                5  Matheus                    10

In [24]:
df3['index'] = 0
df3

      identificação    nomes  identificação_mais_5  index
29                1     Caio                     6      0
1                 2  Rodrigo                     7      0
0                 3   Rafael                     8      0
2222              4  Mariana                     9      0
88                5  Matheus                    10      0

In [25]:
# atualizando o índice do df
df3.index = [29, 0, 1, 2222, 88]
df3

      identificação    nomes  identificação_mais_5  index
29                1     Caio                     6      0
0                 2  Rodrigo                     7      0
1                 3   Rafael                     8      0
2222              4  Mariana                     9      0
88                5  Matheus                    10      0

#### Selecionando colunas

In [26]:
# selecionando a coluna nomes
df3['nomes']

29         Caio
0       Rodrigo
1        Rafael
2222    Mariana
88      Matheus
Name: nomes, dtype: object

In [27]:
# esta forma de selecionar colunas só funciona para nomes que não seja palavras reservadas e que não contenham espaços
df3.nomes

29         Caio
0       Rodrigo
1        Rafael
2222    Mariana
88      Matheus
Name: nomes, dtype: object

In [28]:
df3['index']

29      0
0       0
1       0
2222    0
88      0
Name: index, dtype: int64

In [29]:
# selecionando mais de uma coluna
df3[['nomes', 'index']]

        nomes  index
29       Caio      0
0     Rodrigo      0
1      Rafael      0
2222  Mariana      0
88    Matheus      0

In [30]:
df3

      identificação    nomes  identificação_mais_5  index
29                1     Caio                     6      0
0                 2  Rodrigo                     7      0
1                 3   Rafael                     8      0
2222              4  Mariana                     9      0
88                5  Matheus                    10      0

In [31]:
# usando lógica para selecionar somente as linhas com identificação par

df3[df3.identificação % 2 == 0]

      identificação    nomes  identificação_mais_5  index
0                 2  Rodrigo                     7      0
2222              4  Mariana                     9      0

In [32]:
# selecionando as linhas onde os nomes começam com R
df3[df3.nomes.str.contains('R')]

   identificação    nomes  identificação_mais_5  index
0              2  Rodrigo                     7      0
1              3   Rafael                     8      0

In [33]:
# selecionando as linhas onde o nome começa com R e a identificação é igual a 3
df3[(df3.nomes.str.contains('R')) & (df3.identificação == 3)]

   identificação   nomes  identificação_mais_5  index
1              3  Rafael                     8      0

In [34]:
# usando a condição or(|) para selecionar as linhas onde o nome começa com R ou a identificação seja igual a 3
df3[(df3.nomes.str.contains('R')) | (df3.identificação == 3)]

   identificação    nomes  identificação_mais_5  index
0              2  Rodrigo                     7      0
1              3   Rafael                     8      0

#### Loc vs iloc
- loc: localiza pelo NOME dos índices ou colunas
- iloc: localiza pela POSIÇÃO dos índices ou colunas

In [35]:
df3

      identificação    nomes  identificação_mais_5  index
29                1     Caio                     6      0
0                 2  Rodrigo                     7      0
1                 3   Rafael                     8      0
2222              4  Mariana                     9      0
88                5  Matheus                    10      0

In [36]:
# retorna os valores na linha onde o nome do índice é 0
df3.loc[0]

identificação                 2
nomes                   Rodrigo
identificação_mais_5          7
index                         0
Name: 0, dtype: object

In [37]:
# retorna os valores localizados no índice 0
df3.iloc[0]

identificação              1
nomes                   Caio
identificação_mais_5       6
index                      0
Name: 29, dtype: object

In [38]:
# usando o loc para selecionar os valores do índice de nome 0 até o índice de nome 1
df3.loc[0:1]

   identificação    nomes  identificação_mais_5  index
0              2  Rodrigo                     7      0
1              3   Rafael                     8      0

In [39]:
# no iloc o fatiamento funciona igual ao de listas onde o segundo valor não é incluso no intervalo selecionado. No exemplo abaixo irá retornar apenas a linha na posição 0
df3.iloc[0:1]

    identificação nomes  identificação_mais_5  index
29              1  Caio                     6      0

In [40]:
df3.iloc[0:2]

    identificação    nomes  identificação_mais_5  index
29              1     Caio                     6      0
0               2  Rodrigo                     7      0

In [41]:
df3

      identificação    nomes  identificação_mais_5  index
29                1     Caio                     6      0
0                 2  Rodrigo                     7      0
1                 3   Rafael                     8      0
2222              4  Mariana                     9      0
88                5  Matheus                    10      0

In [42]:
# no código abaixo selecionamos as linhas a partir do nome 88 até o nome 1, para isso basta informarmos o passo como -1 no final do intervalo.
df3.loc[88:1:-1]

      identificação    nomes  identificação_mais_5  index
88                5  Matheus                    10      0
2222              4  Mariana                     9      0
1                 3   Rafael                     8      0

In [43]:
df3

      identificação    nomes  identificação_mais_5  index
29                1     Caio                     6      0
0                 2  Rodrigo                     7      0
1                 3   Rafael                     8      0
2222              4  Mariana                     9      0
88                5  Matheus                    10      0

In [44]:
# selecionando todas as linhas de uma coluna usando o loc
df3.loc[:,'nomes']

29         Caio
0       Rodrigo
1        Rafael
2222    Mariana
88      Matheus
Name: nomes, dtype: object

In [45]:
# selecionando todas as linhas de uma coluna usando o iloc
df3.iloc[:, 1]

29         Caio
0       Rodrigo
1        Rafael
2222    Mariana
88      Matheus
Name: nomes, dtype: object

In [46]:
# selecionando um valor específico no df
df3.loc[2222, 'nomes']

'Mariana'

In [47]:
# selecionando um valor específico usando iloc
df3.iloc[3,1]

'Mariana'

In [48]:
# atualizando um valor dentro do df
df3.loc[2222, 'nomes'] = 'Jeremias'

In [49]:
df3

      identificação     nomes  identificação_mais_5  index
29                1      Caio                     6      0
0                 2   Rodrigo                     7      0
1                 3    Rafael                     8      0
2222              4  Jeremias                     9      0
88                5   Matheus                    10      0

In [50]:
df3.iloc[-1]

identificação                 5
nomes                   Matheus
identificação_mais_5         10
index                         0
Name: 88, dtype: object

In [51]:
# selecioinando um valor dentro do df
df3.iloc[-1, -2]

10

In [52]:
df3

      identificação     nomes  identificação_mais_5  index
29                1      Caio                     6      0
0                 2   Rodrigo                     7      0
1                 3    Rafael                     8      0
2222              4  Jeremias                     9      0
88                5   Matheus                    10      0

In [53]:
# retornando mais de um valor com loc
df3.loc[[0, 2222]]

      identificação     nomes  identificação_mais_5  index
0                 2   Rodrigo                     7      0
2222              4  Jeremias                     9      0

In [54]:
# retornando mais de um valor com iloc
df3.iloc[[1, 3]]

      identificação     nomes  identificação_mais_5  index
0                 2   Rodrigo                     7      0
2222              4  Jeremias                     9      0

### Atributos de DataFrames

In [55]:
df3

      identificação     nomes  identificação_mais_5  index
29                1      Caio                     6      0
0                 2   Rodrigo                     7      0
1                 3    Rafael                     8      0
2222              4  Jeremias                     9      0
88                5   Matheus                    10      0

In [56]:
# dtypes exibe os tipos de dados de cada coluna
df3.dtypes

identificação            int64
nomes                   object
identificação_mais_5     int64
index                    int64
dtype: object

In [57]:
# modificando o tipo de dado de uma coluna usando astype
df3.identificação = df3.identificação.astype(str)
df3.dtypes

identificação           object
nomes                   object
identificação_mais_5     int64
index                    int64
dtype: object

In [58]:
df3

     identificação     nomes  identificação_mais_5  index
29               1      Caio                     6      0
0                2   Rodrigo                     7      0
1                3    Rafael                     8      0
2222             4  Jeremias                     9      0
88               5   Matheus                    10      0

In [59]:
df3['teste1']= [None, 2, 4, None, 10]
df3

     identificação     nomes  identificação_mais_5  index  teste1
29               1      Caio                     6      0     NaN
0                2   Rodrigo                     7      0     2.0
1                3    Rafael                     8      0     4.0
2222             4  Jeremias                     9      0     NaN
88               5   Matheus                    10      0    10.0

In [60]:
df3.dtypes

identificação            object
nomes                    object
identificação_mais_5      int64
index                     int64
teste1                  float64
dtype: object

In [61]:
# o atributo columns retorna as colunas do df
df3.columns

Index(['identificação', 'nomes', 'identificação_mais_5', 'index', 'teste1'], dtype='object')

In [62]:
# modificando o nome de uma coluna
df3.columns = ['identificação', 'nomes', 'identificação_mais_5', 'index_modificado', 'teste1']

In [63]:
df3

     identificação     nomes  identificação_mais_5  index_modificado  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Matheus                    10                 0    10.0

In [64]:
# retorna os índices do df
df3.index

Index([29, 0, 1, 2222, 88], dtype='int64')

In [65]:
# retona a quantidade de linhas e colunas do df
df3.shape

(5, 5)

In [66]:
# retorna os valores do df onde cada linha é uma lista
df3.values

array([['1', 'Caio', 6, 0, nan],
       ['2', 'Rodrigo', 7, 0, 2.0],
       ['3', 'Rafael', 8, 0, 4.0],
       ['4', 'Jeremias', 9, 0, nan],
       ['5', 'Matheus', 10, 0, 10.0]], dtype=object)

### Métodos I

#### combine_first

Atualiza os elementos nulos de uma coluna com o valor na mesma localização em outra coluna.

In [67]:
df3

     identificação     nomes  identificação_mais_5  index_modificado  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Matheus                    10                 0    10.0

In [68]:
# os valores da coluna teste1 serão combinados com os valores da coluna 'identificação_mais_5' e onde forem nulos assumirão o valor correspondente ao índice da linha.
df3.teste1.combine_first(df3['identificação_mais_5'])

29       6.0
0        2.0
1        4.0
2222     9.0
88      10.0
Name: teste1, dtype: float64

#### copy

Realiza a cópia de um dataframe

In [69]:
df1000 = df3.copy()
df1000

     identificação     nomes  identificação_mais_5  index_modificado  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Matheus                    10                 0    10.0

#### count

Mostra a quantidade de linhas não nulas em uma coluna

In [70]:
df3.count()

identificação           5
nomes                   5
identificação_mais_5    5
index_modificado        5
teste1                  3
dtype: int64

#### drop
Utilizado para excluir colunas ou índices. Ao usar o drop o resultado mostra apenas como ficaria o resultado não eliminando definitivamente a coluna ou índice, para isso é necessário usar o parâmetro ``inplace=True``

In [71]:
df3.drop(columns=['index_modificado'])

     identificação     nomes  identificação_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN
88               5   Matheus                    10    10.0

In [72]:
df3

     identificação     nomes  identificação_mais_5  index_modificado  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Matheus                    10                 0    10.0

In [73]:
df3.drop(columns=['index_modificado'], inplace=True)

In [74]:
df3

     identificação     nomes  identificação_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN
88               5   Matheus                    10    10.0

In [75]:
# usando o drop para ídice (linha)
df3.drop(index= [88], inplace=True)

In [76]:
df3

     identificação     nomes  identificação_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN

#### drop_duplicates
Usado para remover valores duplicados

In [77]:
df7 = pd.concat([df1000, df1000])

In [78]:
df7

     identificação     nomes  identificação_mais_5  index_modificado  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Matheus                    10                 0    10.0
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Matheus                    10                 0    10.0

In [79]:
df7.drop_duplicates(inplace=True)
df7

     identificação     nomes  identificação_mais_5  index_modificado  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Matheus                    10                 0    10.0

#### dropna
Remove as linhas com valores nulos

In [80]:
df8 = df7.copy()

In [81]:
df8.dropna(inplace=True)
df8

   identificação    nomes  identificação_mais_5  index_modificado  teste1
0              2  Rodrigo                     7                 0     2.0
1              3   Rafael                     8                 0     4.0
88             5  Matheus                    10                 0    10.0

#### fillna
Realiza a substituição dos valores nulos por outro valor

In [82]:
df7

     identificação     nomes  identificação_mais_5  index_modificado  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Matheus                    10                 0    10.0

In [83]:
df7.fillna('NULO', inplace=True)

In [84]:
df7

     identificação     nomes  identificação_mais_5  index_modificado teste1
29               1      Caio                     6                 0   NULO
0                2   Rodrigo                     7                 0    2.0
1                3    Rafael                     8                 0    4.0
2222             4  Jeremias                     9                 0   NULO
88               5   Matheus                    10                 0   10.0

#### head
Retorna as primeiras linhas do df. Como parâmetro podemos informa a quantidade de linhas que queremos

In [85]:
df7.head(2)

   identificação    nomes  identificação_mais_5  index_modificado teste1
29             1     Caio                     6                 0   NULO
0              2  Rodrigo                     7                 0    2.0

#### tail
Retorna as últimas linhas do df. Como parâmetro podemos informar a quantidade de linhas que queremos.

In [86]:
df7.tail(2)

     identificação     nomes  identificação_mais_5  index_modificado teste1
2222             4  Jeremias                     9                 0   NULO
88               5   Matheus                    10                 0   10.0

#### groupby
Realiza o agrupamento de linhas semelhante ao sql.

In [87]:
df10 = pd.concat([df1000, df1000])

In [88]:
df10

     identificação     nomes  identificação_mais_5  index_modificado  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Matheus                    10                 0    10.0
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Matheus                    10                 0    10.0

In [89]:
df10.groupby(['nomes']).identificação_mais_5.sum()

nomes
Caio        12
Jeremias    18
Matheus     20
Rafael      16
Rodrigo     14
Name: identificação_mais_5, dtype: int64

In [90]:
'''
    SELECT
        nome,
        sum(identificação_mais_5)
    from df10
    group by nome
'''

'\n    SELECT\n        nome,\n        sum(identificação_mais_5)\n    from df10\n    group by nome\n'

### Métodos II

In [91]:
df3

     identificação     nomes  identificação_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN

#### isin
Retorna se cada elemento no df istá contido nos valores informados como parâmetro, em caso positivo retorna ``True`` e negativo retorna ``False``

In [92]:
df3.isin([2, 4])

      identificação  nomes  identificação_mais_5  teste1
29            False  False                 False   False
0             False  False                 False    True
1             False  False                 False    True
2222          False  False                 False   False

In [93]:
df3.isin(['2', '4'])

      identificação  nomes  identificação_mais_5  teste1
29            False  False                 False   False
0              True  False                 False   False
1             False  False                 False   False
2222           True  False                 False   False

In [94]:
# realizando o fatiamento do df usando isin

df3[df3.identificação.isin(['2','4'])]

     identificação     nomes  identificação_mais_5  teste1
0                2   Rodrigo                     7     2.0
2222             4  Jeremias                     9     NaN

In [95]:
df3[df3.teste1.isin([2,4])]

  identificação    nomes  identificação_mais_5  teste1
0             2  Rodrigo                     7     2.0
1             3   Rafael                     8     4.0

#### Métodos de operações matemáticas

In [96]:
df3

     identificação     nomes  identificação_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN

In [97]:
# min retorna o valor mínimo de uma coluna
df3.identificação_mais_5.min()

6

In [98]:
# max retorna o valor máximo de uma coluna
df3.identificação_mais_5.max()

9

In [99]:
# mean retorna o valor médio de uma coluna
df3.identificação_mais_5.mean()

7.5

In [100]:
# median retorna a mediana da coluna
df3.identificação_mais_5.median()

7.5

In [101]:
# sum retorna a soma dos valores da coluna
df3.identificação_mais_5.sum()

30

In [102]:
# std retorna o desvio padrão da coluna
df3.identificação_mais_5.std()

1.2909944487358056

#### notnull
Rotorna `True` para valores não nulos e `False` para valores nulos.

In [103]:
df3

     identificação     nomes  identificação_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN

In [104]:
df3.teste1.notnull()

29      False
0        True
1        True
2222    False
Name: teste1, dtype: bool

In [105]:
# realizando fatiamennto usando notnull
df3[df3.teste1.notnull() == True]

  identificação    nomes  identificação_mais_5  teste1
0             2  Rodrigo                     7     2.0
1             3   Rafael                     8     4.0

#### rename
Usado para renomear colunas ou linhas

In [106]:
df3

     identificação     nomes  identificação_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN

In [107]:
df3.rename(columns={'nomes':'Nome'}, inplace=True)

In [108]:
df3

     identificação      Nome  identificação_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN

In [109]:
# modificando uma linha usando o rename
df3.rename(index={2222: -1}, inplace=True)

In [110]:
df3

    identificação      Nome  identificação_mais_5  teste1
 29             1      Caio                     6     NaN
 0              2   Rodrigo                     7     2.0
 1              3    Rafael                     8     4.0
-1              4  Jeremias                     9     NaN

#### replace
Substitui valores no dataframe

In [111]:
df3

    identificação      Nome  identificação_mais_5  teste1
 29             1      Caio                     6     NaN
 0              2   Rodrigo                     7     2.0
 1              3    Rafael                     8     4.0
-1              4  Jeremias                     9     NaN

In [112]:
df3.Nome.replace('Jeremias', 'Mariane', inplace=True)

In [113]:
df3

    identificação     Nome  identificação_mais_5  teste1
 29             1     Caio                     6     NaN
 0              2  Rodrigo                     7     2.0
 1              3   Rafael                     8     4.0
-1              4  Mariane                     9     NaN

#### round
Realiza o arredondamento de casas decimais

In [115]:
df3['teste2'] = [1.2, 3.6451, 2.98018, 9.13]

In [116]:
df3

    identificação     Nome  identificação_mais_5  teste1   teste2
 29             1     Caio                     6     NaN  1.20000
 0              2  Rodrigo                     7     2.0  3.64510
 1              3   Rafael                     8     4.0  2.98018
-1              4  Mariane                     9     NaN  9.13000

In [117]:
df3.teste2.round(0)

 29    1.0
 0     4.0
 1     3.0
-1     9.0
Name: teste2, dtype: float64

In [118]:
df3.teste2.round(2)

 29    1.20
 0     3.65
 1     2.98
-1     9.13
Name: teste2, dtype: float64

In [120]:
df3.teste2 = df3.teste2.round(2)

In [121]:
df3

    identificação     Nome  identificação_mais_5  teste1  teste2
 29             1     Caio                     6     NaN    1.20
 0              2  Rodrigo                     7     2.0    3.65
 1              3   Rafael                     8     4.0    2.98
-1              4  Mariane                     9     NaN    9.13

#### to_clipboard
Copia o dataframe para a área de transferência

In [122]:
df3.to_clipboard()

In [123]:
df3.to_clipboard(index=False)